/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minkyeki <minkyeki@42SEOUL.KR>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/07 21:43:57 by minkyeki          #+#    #+#             */
/*   Updated: 2022/03/11 17:22:33 by minkyeki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stddef.h>
/** 메모리를 0으로 채움(이때 s는 string) */

// TODO: 이때, char 타입으로 대입해 아님 unsigned char 타입으로 대입해??
// bzero는 null문자 종료 조건이 필요 없어?? 왜? 
// TODO : 위 대로 조건 하나 쏙 빼니까 오류 꺼짐 ;;;


void	ft_bzero(void *s, size_t n)
{
	char	*tmp;
	size_t	i;

	i = 0;
	tmp = (char *)s;
	while (i < n)
	{
		tmp[i] = 0;
		++i;
	}
}
