/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minkyeki <minkyeki@42SEOUL.KR>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/13 14:11:57 by minkyeki          #+#    #+#             */
/*   Updated: 2022/03/14 17:37:17 by minkyeki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/** 
 *
 * error log : 함수 인자 전달할때 잘못함. s의 포인터가 이동하지 않음!ㅊ
 *
 *
 * */


void ft_striteri(char *s, void (*f)(unsigned int, char*))
{
	unsigned int	i;

	i = 0;
	while (s[i])
	{
		f(i, s + i);
		++i;
	}
	s[i] = '\0';
}
