/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalpha.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minkyeki <minkyeki@42SEOUL.KR>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/07 20:48:33 by minkyeki          #+#    #+#             */
/*   Updated: 2022/03/11 13:42:26 by minkyeki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/** 이 함수는 isalpha 함수는 영문 대문자이면 1을 반환하고 
 * 소문자이면 2를 반환하며 영문자가 아니면 0을 반환하게 하면 됩니다.  */

int	ft_isalpha(int c)
{
	if (c >= 'A' && c <= 'Z')
		return (1);
	else if (c >= 'a' && c <= 'z')
		return (2);
	else
		return (0);	
}
