/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minkyeki <minkyeki@42SEOUL.KR>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/07 21:01:51 by minkyeki          #+#    #+#             */
/*   Updated: 2022/03/11 13:43:22 by minkyeki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/** isalnum은 c 에 대해 isalpha 또는 isdigit가 0이 아니면 0이 아닌 값을 반환합니다 */

int	ft_isalnum(int c)
{
	if (c >= '0' && c <= '9')
		return (1);
	else if (c >= 'A' && c <= 'Z')
		return (1);
	else if (c >= 'a' && c <= 'z')
		return (1);
	else
		return (0);
}
