/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minkyeki <minkyeki@42SEOUL.KR>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/09 15:42:20 by minkyeki          #+#    #+#             */
/*   Updated: 2022/03/11 14:52:52 by minkyeki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/** 널을 만날 때 까지 진행 처음 만나는 int타입 문자 c의 포인터 위치를 반환한다. */

// TODO : why is c int type? why not char???
// TODO : 대체 왜 int를 쓰는 건지 그 이유는 반드시 알아내자. 

char	*ft_strchr(const char *s, int c)
{
	while (*s)
	{
		if (*s == (char)c)
			return ((char *)s);
		++s;
	}
	if (c == '\0')
		return ((char *)s);
	return (0);
}

/** Error log
 * c가 '\0'일 때, 포인터는 문자열 마지막이여야 한다.... 0이 아니다.*/
